# Pandas

- It contains data structures and data manipulation tools designed to make data cleaning and analysis fast and easy in Python.
- pandas is often used in tandem with numerical computing tools like NumPy and SciPy, analytical libraries like statsmodels and scikit-learn, and data visualization libraries like matplotlib.
- While pandas adopts many coding idioms from NumPy, the biggest difference is that pandas is designed for working with tabular or heterogeneous data. NumPy, by contrast, is best suited for working with homogeneous numerical array data.

# Installation

- pip install pandas

# Importing

-  import pandas as pd
-  from pandas import Series, DataFrame

# pandas Data Structures

- Series and DataFrame.

## Series

-  A Series is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its index.

In [2]:
#  The simplest Series is formed from only an array of data.
import pandas as pd
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

- The string representation of a Series displayed interactively shows the index on the left and the values on the right.
- Since we did not specify an index for the data, a default one consisting of the integers 0 through N - 1 (where N is the length of the data) is created.
- You can get the array representation and index object of the Series via its values and index attributes

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

- Often it will be desirable to create a Series with an index identifying each data point with a label.

In [5]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

- you can use labels in the index when selecting single values or a set of values

In [7]:
obj2['a']

-5

In [8]:
obj2['d'] = 6

In [9]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

- Here ['c', 'a', 'd'] is interpreted as a list of indices, even though it contains strings instead of integers.
- Using NumPy functions or NumPy-like operations, such as filtering with a boolean array, scalar multiplication, or applying math functions, will preserve the index-value link.

In [10]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [11]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

- Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values.
- It can be used in many contexts where you might use a dict.

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

- Should you have data contained in a Python dict, you can create a Series from it by passing the dict.

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

- When you are only passing a dict, the index in the resulting Series will have the dict’s keys in sorted order.
- You can override this by passing the dict keys in the order you want them to appear in the resulting Series

In [17]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

-  Here, three values found in sdata were placed in the appropriate locations, but since no value for 'California' was found, it appears as NaN (not a number), which is con sidered in pandas to mark missing or NA values.
-  Since 'Utah' was not included in states, it is excluded from the resulting object.
-  The isnull and notnull functions in pandas should be used to detect missing data

In [18]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
#  Series also has these as instance methods.
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

- A useful Series feature for many applications is that it automatically aligns by index label in arithmetic operations

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

- you can think about this as being similar to a join operation.

-  Both the Series object itself and its index have a name attribute, which integrates with other key areas of pandas functionality.

In [24]:
obj4.name = 'population'

In [25]:
obj4.index.name = 'state'

In [26]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [27]:
# A Series’s index can be altered in-place by assignment.
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [29]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

- A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string,boolean, etc.).
- The DataFrame has both a row and column index; it can be thought of as a dict of Series all sharing the same index.
- the data is stored as one or more two-dimensional blocks rather than a list, dict, or some other collection of one-dimensional arrays.
-  While a DataFrame is physically two-dimensional, you can use it to represent higher dimensional data in a tabular format using hierarchical indexing.

In [31]:
# There are many ways to construct a DataFrame, though one of the most common is from a dict of equal-length lists or NumPy arrays.
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

-  The resulting DataFrame will have its index assigned automatically as with Series, and the columns are placed in sorted order.

-  For large DataFrames, the head method selects only the first five rows.

In [32]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [33]:
#  If you specify a sequence of columns, the DataFrame’s columns will be arranged in that order.
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

-  If you pass a column that isn’t contained in the dict, it will appear with missing values
 in the result.

In [34]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [35]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

-  A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute.

In [36]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [37]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

- Attribute-like access (frame2.year) and tab completion of column names in IPython is provided as a convenience.
- frame2[column] works for any column name, but frame2.column only works when the column name is a valid Python variable name.
- **Note** :that the returned Series have the same index as the DataFrame, and their name attribute has been appropriately set.

- Rows can also be retrieved by position or name with the special loc attribute.

In [38]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

- Columns can be modified by assignment. For example, the empty 'debt' column
 could be assigned a scalar value or an array of values.

In [39]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [40]:
frame2['debt'] = np.arange(6.)

In [41]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

- When you are assigning lists or arrays to a column, the value’s length must match the
 length of the DataFrame.
- If you assign a Series, its labels will be realigned exactly to
 the DataFrame’s index, inserting missing values in any holes.

In [42]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

- Assigning a column that doesn’t exist will create a new column.
- The del keyword will
 delete columns .

In [44]:
# add a new column of boolean values where the state column equals 'Ohio'
# New columns cannot be created with the frame2.eastern syntax.
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [45]:
#  The del method can then be used to remove this column.
del frame2['eastern']

In [46]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

- The column returned from indexing a DataFrame is a view on the underlying data, not a copy. Thus, any in-place modifications to the Series will be reflected in the DataFrame.
- The column can be explicitly copied with the Series’s copy method.

In [48]:
# Another common form of data is a nested dict of dicts.
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

- If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys
 as the columns and the inner keys as the row indices.

In [49]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

- You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array.

In [50]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

-  The keys in the inner dicts are combined and sorted to form the index in the result.
-   This isn’t true if an explicit index is specified.

In [51]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [52]:
# Dicts of Series are treated in much the same way
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

- If a DataFrame’s index and columns have their name attributes set, these will also be displayed.

In [53]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

- As with Series, the values attribute returns the data contained in the DataFrame as a
 two-dimensional ndarray.

In [54]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

- If the DataFrame’s columns are different dtypes, the dtype of the values array will be
 chosen to accommodate all of the columns.

In [55]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

#### Possible data inputs to DataFrame constructor

| Type | Notes |
|--------------|------------|
|2D ndarray| A matrix of data, passing optional row and column labels|
|dict of arrays, lists, or tuples | Each sequence becomes a column in the DataFrame; all sequences must be the same length|
| NumPy structured/record array | Treated as the “dict of arrays” case|
|dict of Series|Each value becomes a column; indexes from each Series are unioned together to form the result’s row index if no explicit index is passed|
|dict of dicts |  Each inner dict becomes a column; keys are unioned to form the row index as in the “dict of Series” case |
| List of dicts or Series| Each item becomes a row in the DataFrame; union of dict keys or Series indexes become the
 DataFrame’s column labels|
|List of lists or tuples|Treated as the “2D ndarray” case|
| Another DataFrame|The DataFrame’s indexes are used unless different ones are passed|
|NumPy MaskedArray|Like the “2D ndarray” case except masked values become NA/missing in the DataFrame result|

## Index Objects

- pandas’s Index objects are responsible for holding the axis labels and other metadata (like the axis name or names).
- Any array or other sequence of labels you use when constructing a Series or DataFrame is internally converted to an Index.

In [56]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [57]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [58]:
index[1:]

Index(['b', 'c'], dtype='object')

- Index objects are immutable and thus can’t be modified by the user.

In [59]:
index[1] = 'd'  # TypeError

TypeError: Index does not support mutable operations

- Immutability makes it safer to share Index objects among data structures.

In [60]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [61]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [62]:
obj2.index is labels

True

In [63]:
#  In addition to being array-like, an Index also behaves like a fixed-size set.
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [64]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [65]:
'Ohio' in frame3.columns

True

In [66]:
2003 in frame3.index

False

In [68]:
#  Unlike Python sets, a pandas Index can contain duplicate labels.
# Selections with duplicate labels will select all occurrences of that label.
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

-  Each Index has a number of methods and properties for set logic, which answer other
 common questions about the data it contains.

|Method|Description|
|-------|-----------|
|append| Concatenate with additional Index objects, producing a new Index|
| difference| Compute set difference as an Index|
|intersection|Compute set intersection|
|union|Compute set union|
|isin|Compute boolean array indicating whether each value is contained in the passed collection|
|delete|Compute new Index with element at index i deleted|
|drop| Compute new Index by deleting passed values|
|insert|Compute new Index by inserting element at index i|
|is_monotonic | Returns True if each element is greater than or equal to the previous element|
|is_unique|Returns True if the Index has no duplicate values|
|unique|Compute the array of unique values in the Index|

# Essential Functionality

- fundamental mechanics of interacting with the data contained in a Series or DataFrame.

## Reindexing

- means to create a new object with the data conformed to a new index.

In [70]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

- Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any index values were not already present

In [71]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

-  For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing.
-  The method option allows us to do this, using a method such as ffill, which forward-fills the values.

In [72]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [73]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

-  With DataFrame, reindex can alter either the (row) index, columns, or both.
-  When passed only a sequence, it reindexes the rows in the result

In [74]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [75]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [76]:
#  The columns can be reindexed with the columns keyword.
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

**reindex function arguments**

|Argument| Description|
|--------|------------|
|index| New sequence to use as index. Can be Index instance or any other sequence-like Python data structure. An Index will be used exactly as is without any copying.|
|method| Interpolation (fill) method; 'ffill' fills forward, while 'bfill' fills backward.|
|fill_value|Substitute value to use when introducing missing data by reindexing.|
|limit| When forward- or backfilling, maximum size gap (in number of elements) to fill.|
|tolerance |When forward- or backfilling, maximum size gap (in absolute numeric distance) to fill for inexact matches.|
|level|Match simple Index on level of MultiIndex; otherwise select subset of.|
|copy| If True, always copy underlying data even if new index is equivalent to old index; if False, do not copy the data when the indexes are equivalent.|

## Dropping Entries from an Axis

- Dropping one or more entries from an axis is easy if you already have an index array or list without those entries. 
- As that can require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted from an axis.

In [79]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [80]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [81]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

- With DataFrame, index values can be deleted from either axis.

In [82]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

-  Calling drop with a sequence of labels will drop values from the row labels (axis 0).

In [83]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

- You can drop values from the columns by passing axis=1 or axis='columns'.

In [84]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [85]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

- Many functions, like drop, which modify the size or shape of a Series or DataFrame, can manipulate an object in-place without returning a new object

In [86]:
obj.drop('c', inplace=True)

In [87]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

## Indexing, Selection, and Filtering

-  Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the Series’s index values instead of only integers.

In [88]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [89]:
obj['b']

1.0

In [90]:
obj[1]

1.0

In [91]:
obj[2]

2.0

In [92]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [93]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [94]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [95]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

- Slicing with labels behaves differently than normal Python slicing in that the endpoint is inclusive

In [96]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [97]:
# Setting using these methods modifies the corresponding section of the Series
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

-  Indexing into a DataFrame is for retrieving one or more columns either with a single value or sequence.

In [98]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [99]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [100]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

-  Indexing like this has a few special cases. First, slicing or selecting data with a boolean array.

In [101]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [102]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

- The row selection syntax data[:2] is provided as a convenience. Passing a single element or a list to the [] operator selects columns.

- Another use case is in indexing with a boolean DataFrame, such as one produced by a
 scalar comparison

In [103]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [104]:
data[data < 5] = 0

In [105]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

- This makes DataFrame syntactically more like a two-dimensional NumPy array

#### Selection with loc and iloc

- For DataFrame label-indexing on the rows.
- They enable you to select a subset of the rows and columns from a DataFrame with NumPy-like notation using either axis labels (loc) or integers(iloc).

In [106]:
# select a single row and multiple columns by label.
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [107]:
# perform some similar selections with integers using iloc.
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [108]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [109]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

- Both indexing functions work with slices in addition to single labels or lists of labels.

In [110]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [111]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

#### Indexing options with DataFrame

|Type| Notes|
|-----|------|
|df[val]| Select single column or sequence of columns from the DataFrame; special case conveniences: boolean array (filter rows), slice (slice rows), or boolean DataFrame(set values based on some criterion)|
|df.loc[val]| Selects single row or subset of rows from the DataFrame by label|
|df.loc[:, val]| Selects single column or subset of columns by label|
|df.loc[val1, val2]|Select both rows and columns by label|
|df.iloc[where]|Selects single row or subset of rows from the DataFrame by integer position|
|df.iloc[:, where]| Selects single column or subset of columns by integer position|
|df.iloc[where_i, where_j]|Select both rows and columns by integer position|
|df.at[label_i, label_j]|Select a single scalar value by row and column label|
|df.iat[i, j]| Select a single scalar value by row and column position (integers)|
|reindex method|Select either rows or columns by labels|
|get_value, set_value methods |Select single value by row and column label|

## Integer Indexes

In [112]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [113]:
ser[-1]

KeyError: -1

-  In this case, pandas could “fall back” on integer indexing, but it’s difficult to do this in general without introducing subtle bugs.
-  Here we have an index containing 0, 1, 2,but inferring what the user wants (label-based indexing or position-based) is difficult

In [114]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

- On the other hand, with a non-integer index, there is no potential for ambiguity.

In [115]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

- To keep things consistent, if you have an axis index containing integers, data selection will always be label-oriented.
- For more precise handling, use loc (for labels) or iloc (for integers).

In [116]:
ser[:1]

0    0.0
dtype: float64

In [117]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [118]:
ser.iloc[:1]

0    0.0
dtype: float64

## Arithmetic and Data Alignment

- An important pandas feature for some applications is the behavior of arithmetic between objects with different indexes.
- When you are adding together objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs.
-  this is similar to an automatic outer join on the index labels.

In [119]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])

In [120]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [121]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [122]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [123]:
# In the case of DataFrame, alignment is performed on both the rows and the columns
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [124]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [125]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

-  Adding these together returns a DataFrame whose index and columns are the unions
 of the ones in each DataFrame.

In [126]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

- Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear
 as all missing in the result.
- The same holds for the rows whose labels are not common
 to both objects.
- If you add DataFrame objects with no column or row labels in common, the result
 will contain all nulls.

In [127]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [128]:
df1

   A
0  1
1  2

In [129]:
df2

   B
0  3
1  4

In [130]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

### Arithmetic methods with fill values

-  In arithmetic operations between differently indexed objects, you might want to fill
 with a special value, like 0, when an axis label is found in one object but not the other.

In [131]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list('abcde'))

In [134]:
df2.loc[1, 'b'] = np.nan

In [135]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [136]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

- Adding these together results in NA values in the locations that don’t overlap.

In [137]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

- Using the add method on df1, I pass df2 and an argument to fill_value.

In [138]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

##### for a listing of Series and DataFrame methods for arithmetic

|Method|Description|
|-------|-----------|
|add, radd|Methods for addition (+)|
|sub, rsub|Methods for subtraction (-)|
|div, rdiv|Methods for division (/)|
|floordiv, rfloordiv|Methods for floor division (//)|
|mul, rmul|Methods for multiplication (*)|
| pow, rpow|Methods for exponentiation (**)|

- Each of them has a counterpart, starting with the letter r, that has arguments flipped.

In [139]:
# these two statements are equivalent
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [140]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

- when reindexing a Series or DataFrame, you can also specify a different fill
 value.

In [141]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between DataFrame and Series

-  As with NumPy arrays of different dimensions, arithmetic between DataFrame and Series is also defined.

In [142]:
arr = np.arange(12.).reshape((3, 4))

In [143]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [144]:
arr[0]

array([0., 1., 2., 3.])

In [145]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

- When we subtract arr[0] from arr, the subtraction is performed once for each row.
- Operations between a DataFrame and a Series are
 similar.

In [146]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [147]:
series = frame.iloc[0]

In [148]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [149]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

- By default, arithmetic between DataFrame and Series matches the index of the Series
 on the DataFrame’s columns, broadcasting down the rows.

In [150]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

- If an index value is not found in either the DataFrame’s columns or the Series’s index,
 the objects will be reindexed to form the union.

In [151]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [152]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

- If you want to instead broadcast over the columns, matching on the rows, you have to
 use one of the arithmetic methods.

In [153]:
series3 = frame['d']

In [154]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [155]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [156]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

- The axis number that you pass is the axis to match on. In this case we mean to match
 on the DataFrame’s row index (axis='index' or axis=0) and broadcast across.

## Function Application and Mapping

-  NumPy ufuncs (element-wise array methods) also work with pandas objects.

In [157]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [160]:
frame

               b         d         e
Utah   -0.767037 -0.874263  0.671653
Ohio    2.440059 -0.011228  0.222263
Texas  -1.526142 -0.891875 -0.409935
Oregon  0.055591 -0.774689 -0.340233

In [161]:
np.abs(frame)

               b         d         e
Utah    0.767037  0.874263  0.671653
Ohio    2.440059  0.011228  0.222263
Texas   1.526142  0.891875  0.409935
Oregon  0.055591  0.774689  0.340233

- Another frequent operation is applying a function on one-dimensional arrays to each column or row.

In [162]:
f = lambda x: x.max() - x.min()

In [164]:
frame.apply(f)

b    3.966201
d    0.880647
e    1.081588
dtype: float64

- Here the function f, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in frame.
- The result is a Series having the columns of frame as its index.

- If you pass axis='columns' to apply, the function will be invoked once per row
 instead.

In [165]:
frame.apply(f, axis='columns')

Utah      1.545915
Ohio      2.451286
Texas     1.116207
Oregon    0.830280
dtype: float64

- Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.

- The function passed to apply need not return a scalar value; it can also return a Series
 with multiple values.

In [166]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [167]:
frame.apply(f)

            b         d         e
min -1.526142 -0.891875 -0.409935
max  2.440059 -0.011228  0.671653

- Element-wise Python functions can be used, too.
- Suppose you wanted to compute a formatted string from each floating-point value in frame.
- You can do this with apply
 map.

In [168]:
format = lambda x: '%.2f' % x

In [169]:
frame.applymap(format)

            b      d      e
Utah    -0.77  -0.87   0.67
Ohio     2.44  -0.01   0.22
Texas   -1.53  -0.89  -0.41
Oregon   0.06  -0.77  -0.34

-  The reason for the name applymap is that Series has a map method for applying an
 element-wise function.

In [170]:
frame['e'].map(format)

Utah       0.67
Ohio       0.22
Texas     -0.41
Oregon    -0.34
Name: e, dtype: object

## Sorting and Ranking

- To sort
 lexicographically by row or column index, use the sort_index method, which returns
 a new, sorted object.

In [171]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [172]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

- With a DataFrame, you can sort by index on either axis

In [173]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [174]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [175]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

- The data is sorted in ascending order by default, but can be sorted in descending
 order, too.

In [176]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

- To sort a Series by its values, use its sort_values method.
- Any missing values are sorted to the end of the Series by default.

In [179]:
obj = pd.Series([4, 7, -3, 2])

In [180]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [181]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [182]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

- When sorting a DataFrame, you can use the data in one or more columns as the sort
 keys.
- To do so, pass one or more column names to the by option of sort_values.

In [183]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [184]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [185]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

- To sort by multiple columns, pass a list of names.

In [186]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

- **Ranking** : assigns ranks from one through the number of valid data points in an array.
- The rank methods for Series and DataFrame are the place to look; by default rank
 breaks ties by assigning each group the mean rank.

In [187]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [188]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

-  Ranks can also be assigned according to the order in which they’re observed in the
 data.

In [190]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

- Here, instead of using the average rank 6.5 for the entries 0 and 2, they instead have
 been set to 6 and 7 because label 0 precedes label 2 in the data.

In [192]:
#  You can rank in descending order.
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

#### Tie-breaking methods with rank

|Method|Description|
|-------|----------|
|'average'|Default: assign the average rank to each entry in the equal group|
|'min'|Use the minimum rank for the whole group|
|'max'|Use the maximum rank for the whole group|
| 'first'|Assign ranks in the order the values appear in the data|
|'dense'|Like method='min', but ranks always increase by 1 in between groups rather than the number of equal elements in a group|

In [193]:
# DataFrame can compute ranks over the rows or the columns.
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [194]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## Axis Indexes with Duplicate Labels

- Up until now all of the examples we’ve looked at have had unique axis labels (index
 values).
- While many pandas functions (like reindex) require that the labels be
 unique, it’s not mandatory.

In [195]:
# Let’s consider a small Series with duplicate indices
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

- The index’s is_unique property can tell you whether its labels are unique or not.

In [196]:
obj.index.is_unique

False

-  Data selection is one of the main things that behaves differently with duplicates.
-  Indexing a label with multiple entries returns a Series, while single entries return a
 scalar value.

In [197]:
obj['a']

a    0
a    1
dtype: int64

In [198]:
obj['c']

4

- This can make your code more complicated, as the output type from indexing can
 vary based on whether a label is repeated or not.

- The same logic extends to indexing rows in a DataFrame.

In [199]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.776307 -0.427779 -1.094615
a  0.505001 -2.236621 -0.492969
b -1.700136 -0.032830  1.519703
b  0.082622  1.617459  0.798715

In [200]:
df.loc['b']

          0         1         2
b -1.700136 -0.032830  1.519703
b  0.082622  1.617459  0.798715

# Summarizing and Computing Descriptive Statistics.

-  pandas objects are equipped with a set of common mathematical and statistical methods.
-  Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame.
-  Compared with the similar methods
 found on NumPy arrays, they have built-in handling for missing data.

In [201]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

-  Calling DataFrame’s sum method returns a Series containing column sums.

In [202]:
df.sum()

one    9.25
two   -5.80
dtype: float64

- Passing axis='columns' or axis=1 sums across the columns instead.

In [203]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

- NA values are excluded unless the entire slice (row or column in this case) is NA.
-  This can be disabled with the skipna option.

In [204]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

#### Options for reduction methods

|Method |Description|
|------|------|
|axis|Axis to reduce over; 0 for DataFrame’s rows and 1 for columns|
|skipna |Exclude missing values; True by default|
|level |Reduce grouped by level if the axis is hierarchically indexed (MultiIndex)|

-  Some methods, like idxmin and idxmax, return indirect statistics like the index value
 where the minimum or maximum values are attained.

In [205]:
df.idxmax()

one    b
two    d
dtype: object

In [206]:
# Other methods are accumulations
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [207]:
# Another type of method is neither a reduction nor an accumulation.
# producing multiple summary statistics in one shot
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [208]:
#On non-numeric data, describe produces alternative summary statistics
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [209]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### list of summary statistics and related methods.

|Method|Description|
|-------|----------|
|count|Number of non-NA values|
|describe|Compute set of summary statistics for Series or each DataFrame column|
|min, max|Compute minimum and maximum values|
|argmin, argmax|Compute index locations (integers) at which minimum or maximum value obtained, respectively|
|idxmin, idxmax|Compute index labels at which minimum or maximum value obtained, respectively|
|quantile|Compute sample quantile ranging from 0 to 1|
|sum|Sum of values|
|mean|Mean of values|
|median|Arithmetic median (50% quantile) of values|
|mad|Mean absolute deviation from mean value|
|prod|Product of all values|
|var|Sample variance of values|
|std| Sample standard deviation of values|
|skew|Sample skewness (third moment) of values|
|kurt|Sample kurtosis (fourth moment) of values|
|cumsum|Cumulative sum of values|
|cummin, cummax |Cumulative minimum or maximum of values, respectively|
|cumprod|Cumulative product of values|
|diff|Compute first arithmetic difference (useful for time series)|
|pct_change|Compute percent changes|

## Unique Values, Value Counts, and Membership.

- Another class of related methods extracts information about the values contained in a
 one-dimensional Series.

In [210]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

- The first function is unique, which gives you an array of the unique values in a Series.
-  The unique values are not necessarily returned in sorted order, but could be sorted
 after the fact if needed (uniques.sort()).

In [212]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

-  Relatedly, value_counts computes a Series
 containing value frequencies.

In [213]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

-  The Series is sorted by value in descending order as a convenience.
-  value_counts is
 also available as a top-level pandas method that can be used with any array or
 sequence.

In [214]:
pd.value_counts(obj.values, sort=False)

a    3
b    2
d    1
c    3
dtype: int64

- isin performs a vectorized set membership check and can be useful in filtering a
 dataset down to a subset of values in a Series or column in a DataFrame.

In [215]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [216]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [217]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

-  Related to isin is the Index.get_indexer method, which gives you an index array
 from an array of possibly non-distinct values into another array of distinct values.

In [218]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [219]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [220]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

#### Unique, value counts, and set membership methods

|method| Description|
|------|-------------|
|isin| Compute boolean array indicating whether each Series value is contained in the passed sequence of values|
| match|Compute integer indices for each value in an array into another array of distinct values; helpful for data alignment and join-type operations|
| unique| Compute array of unique values in a Series, returned in the order observed|
|value_counts|Return a Series containing unique values as its index and frequencies as its values, ordered count in descending order|

In [221]:
#  In some cases, you may want to compute a histogram on multiple related columns in a DataFrame.
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [222]:
# Passing pandas.value_counts to this DataFrame’s apply function gives:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

-  Here, the row labels in the result are the distinct values occurring in all of the col
umns.
- The values are the respective counts of these values in each column.